ir_version: 9
producer_name: "pytorch"
producer_version: "2.3.1"
domain: ""
graph {
  node {
    output: "Conv_Res_3.bn.running_var"
    name: "node_Conv_Res_3.bn.running_var"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: "Conv_Res_3.bn.running_var"
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "Conv_Res_3.bn.running_mean"
    name: "node_Conv_Res_3.bn.running_mean"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: "Conv_Res_3.bn.running_mean"
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "Conv_Res_2.bn.running_var"
    name: "node_Conv_Res_2.bn.running_var"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: "Conv_Res_2.bn.running_var"
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "Conv_Res_2.bn.running_mean"
    name: "node_Conv_Res_2.bn.running_mean"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: "Conv_Res_2.bn.running_mean"
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "Conv_Res_1.bn.running_var"
    name: "node_Conv_Res_1.bn.running_var"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: "Conv_Res_1.bn.running_var"
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "Conv_Res_1.bn.running_mean"
    name: "node_Conv_Res_1.bn.running_mean"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: "Conv_Res_1.bn.running_mean"
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "Conv_7_2.bn.running_var"
    name: "node_Conv_7_2.bn.running_var"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: "Conv_7_2.bn.running_var"
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "Conv_7_2.bn.running_mean"
    name: "node_Conv_7_2.bn.running_mean"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: "Conv_7_2.bn.running_mean"
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "Conv_7_1.bn.running_var"
    name: "node_Conv_7_1.bn.running_var"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: "Conv_7_1.bn.running_var"
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "Conv_7_1.bn.running_mean"
    name: "node_Conv_7_1.bn.running_mean"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: "Conv_7_1.bn.running_mean"
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "Conv_12_6.bn.running_var"
    name: "node_Conv_12_6.bn.running_var"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: "Conv_12_6.bn.running_var"
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "Conv_12_6.bn.running_mean"
    name: "node_Conv_12_6.bn.running_mean"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: "Conv_12_6.bn.running_mean"
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "Conv_12_5.bn.running_var"
    name: "node_Conv_12_5.bn.running_var"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: "Conv_12_5.bn.running_var"
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "Conv_12_5.bn.running_mean"
    name: "node_Conv_12_5.bn.running_mean"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: "Conv_12_5.bn.running_mean"
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "Conv_12_4.bn.running_var"
    name: "node_Conv_12_4.bn.running_var"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: "Conv_12_4.bn.running_var"
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "Conv_12_4.bn.running_mean"
    name: "node_Conv_12_4.bn.running_mean"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: "Conv_12_4.bn.running_mean"
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "Conv_12_3.bn.running_var"
    name: "node_Conv_12_3.bn.running_var"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: "Conv_12_3.bn.running_var"
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "Conv_12_3.bn.running_mean"
    name: "node_Conv_12_3.bn.running_mean"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: "Conv_12_3.bn.running_mean"
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "Conv_12_2.bn.running_var"
    name: "node_Conv_12_2.bn.running_var"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: "Conv_12_2.bn.running_var"
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "Conv_12_2.bn.running_mean"
    name: "node_Conv_12_2.bn.running_mean"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: "Conv_12_2.bn.running_mean"
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "Conv_12_1.bn.running_var"
    name: "node_Conv_12_1.bn.running_var"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: "Conv_12_1.bn.running_var"
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "Conv_12_1.bn.running_mean"
    name: "node_Conv_12_1.bn.running_mean"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: "Conv_12_1.bn.running_mean"
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "Conv_24_6.bn.running_var"
    name: "node_Conv_24_6.bn.running_var"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: "Conv_24_6.bn.running_var"
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "Conv_24_6.bn.running_mean"
    name: "node_Conv_24_6.bn.running_mean"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: "Conv_24_6.bn.running_mean"
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "Conv_24_5.bn.running_var"
    name: "node_Conv_24_5.bn.running_var"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: "Conv_24_5.bn.running_var"
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "Conv_24_5.bn.running_mean"
    name: "node_Conv_24_5.bn.running_mean"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: "Conv_24_5.bn.running_mean"
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "Conv_24_4.bn.running_var"
    name: "node_Conv_24_4.bn.running_var"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: "Conv_24_4.bn.running_var"
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "Conv_24_4.bn.running_mean"
    name: "node_Conv_24_4.bn.running_mean"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: "Conv_24_4.bn.running_mean"
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "input"
    input: "onnx::Conv_671"
    output: "/Conv_96/Conv_output_0"
    name: "/Conv_96/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "/Conv_24_2/bn/Constant_output_0"
    name: "/Conv_24_2/bn/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: ""
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_24_2/bn/Constant_1_output_0"
    name: "/Conv_24_2/bn/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: ""
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_24_3/bn/Constant_output_0"
    name: "/Conv_24_3/bn/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: ""
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_24_3/bn/Constant_1_output_0"
    name: "/Conv_24_3/bn/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: ""
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_24_4/bn/Constant_output_0"
    name: "/Conv_24_4/bn/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: ""
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_24_4/bn/Constant_1_output_0"
    name: "/Conv_24_4/bn/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: ""
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_24_5/bn/Constant_output_0"
    name: "/Conv_24_5/bn/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: ""
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_24_5/bn/Constant_1_output_0"
    name: "/Conv_24_5/bn/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: ""
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_24_6/bn/Constant_output_0"
    name: "/Conv_24_6/bn/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: ""
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_24_6/bn/Constant_1_output_0"
    name: "/Conv_24_6/bn/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: ""
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_12_1/bn/Constant_output_0"
    name: "/Conv_12_1/bn/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: ""
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_12_1/bn/Constant_1_output_0"
    name: "/Conv_12_1/bn/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: ""
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_12_2/bn/Constant_output_0"
    name: "/Conv_12_2/bn/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: ""
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_12_2/bn/Constant_1_output_0"
    name: "/Conv_12_2/bn/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: ""
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_12_3/bn/Constant_output_0"
    name: "/Conv_12_3/bn/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: ""
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_12_3/bn/Constant_1_output_0"
    name: "/Conv_12_3/bn/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: ""
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_12_4/bn/Constant_output_0"
    name: "/Conv_12_4/bn/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: ""
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_12_4/bn/Constant_1_output_0"
    name: "/Conv_12_4/bn/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: ""
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_12_5/bn/Constant_output_0"
    name: "/Conv_12_5/bn/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: ""
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_12_5/bn/Constant_1_output_0"
    name: "/Conv_12_5/bn/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: ""
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_12_6/bn/Constant_output_0"
    name: "/Conv_12_6/bn/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: ""
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_12_6/bn/Constant_1_output_0"
    name: "/Conv_12_6/bn/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: ""
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_7_1/bn/Constant_output_0"
    name: "/Conv_7_1/bn/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: ""
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_7_1/bn/Constant_1_output_0"
    name: "/Conv_7_1/bn/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: ""
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_7_2/bn/Constant_output_0"
    name: "/Conv_7_2/bn/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: ""
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_7_2/bn/Constant_1_output_0"
    name: "/Conv_7_2/bn/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: ""
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_Res_1/bn/Constant_output_0"
    name: "/Conv_Res_1/bn/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: ""
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_Res_1/bn/Constant_1_output_0"
    name: "/Conv_Res_1/bn/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 32
        data_type: 1
        name: ""
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_Res_2/bn/Constant_output_0"
    name: "/Conv_Res_2/bn/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: ""
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_Res_2/bn/Constant_1_output_0"
    name: "/Conv_Res_2/bn/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: ""
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_Res_3/bn/Constant_output_0"
    name: "/Conv_Res_3/bn/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: ""
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_Res_3/bn/Constant_1_output_0"
    name: "/Conv_Res_3/bn/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        name: ""
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Constant_output_0"
    name: "/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        name: ""
        raw_data: "\003\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Constant_1_output_0"
    name: "/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        name: ""
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Constant_2_output_0"
    name: "/Constant_2"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        name: ""
        raw_data: "\n\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Constant_3_output_0"
    name: "/Constant_3"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        name: ""
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Constant_4_output_0"
    name: "/Constant_4"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        name: ""
        raw_data: "\003\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Constant_5_output_0"
    name: "/Constant_5"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        name: ""
        raw_data: "\n\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Constant_6_output_0"
    name: "/Constant_6"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        name: ""
        raw_data: "\377\377\377\377\377\377\377\177"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Constant_7_output_0"
    name: "/Constant_7"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        name: ""
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_96/Pow_output_0"
    name: "node_/Conv_96/Pow_output_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        name: "/Conv_96/Pow_output_0"
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_48/Pow_output_0"
    name: "node_/Conv_48/Pow_output_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        name: "/Conv_48/Pow_output_0"
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_24_1/Pow_output_0"
    name: "node_/Conv_24_1/Pow_output_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        name: "/Conv_24_1/Pow_output_0"
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_24_2/Pow_output_0"
    name: "node_/Conv_24_2/Pow_output_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        name: "/Conv_24_2/Pow_output_0"
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_24_3/Pow_output_0"
    name: "node_/Conv_24_3/Pow_output_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        name: "/Conv_24_3/Pow_output_0"
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_24_4/Pow_output_0"
    name: "node_/Conv_24_4/Pow_output_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        name: "/Conv_24_4/Pow_output_0"
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_24_5/Pow_output_0"
    name: "node_/Conv_24_5/Pow_output_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        name: "/Conv_24_5/Pow_output_0"
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_24_6/Pow_output_0"
    name: "node_/Conv_24_6/Pow_output_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        name: "/Conv_24_6/Pow_output_0"
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_12_1/Pow_output_0"
    name: "node_/Conv_12_1/Pow_output_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        name: "/Conv_12_1/Pow_output_0"
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_12_2/Pow_output_0"
    name: "node_/Conv_12_2/Pow_output_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        name: "/Conv_12_2/Pow_output_0"
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_12_3/Pow_output_0"
    name: "node_/Conv_12_3/Pow_output_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        name: "/Conv_12_3/Pow_output_0"
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_12_4/Pow_output_0"
    name: "node_/Conv_12_4/Pow_output_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        name: "/Conv_12_4/Pow_output_0"
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_12_5/Pow_output_0"
    name: "node_/Conv_12_5/Pow_output_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        name: "/Conv_12_5/Pow_output_0"
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_12_6/Pow_output_0"
    name: "node_/Conv_12_6/Pow_output_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        name: "/Conv_12_6/Pow_output_0"
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_7_1/Pow_output_0"
    name: "node_/Conv_7_1/Pow_output_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        name: "/Conv_7_1/Pow_output_0"
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_7_2/Pow_output_0"
    name: "node_/Conv_7_2/Pow_output_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        name: "/Conv_7_2/Pow_output_0"
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_Res_1/Pow_output_0"
    name: "node_/Conv_Res_1/Pow_output_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        name: "/Conv_Res_1/Pow_output_0"
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_Res_2/Pow_output_0"
    name: "node_/Conv_Res_2/Pow_output_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        name: "/Conv_Res_2/Pow_output_0"
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_Res_3/Pow_output_0"
    name: "node_/Conv_Res_3/Pow_output_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        name: "/Conv_Res_3/Pow_output_0"
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_Res_4/Pow_output_0"
    name: "node_/Conv_Res_4/Pow_output_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        name: "/Conv_Res_4/Pow_output_0"
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_96/calc_out_scale/Exp_output_0"
    name: "node_/Conv_96/calc_out_scale/Exp_output_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        name: "/Conv_96/calc_out_scale/Exp_output_0"
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_48/calc_out_scale/Exp_output_0"
    name: "node_/Conv_48/calc_out_scale/Exp_output_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        name: "/Conv_48/calc_out_scale/Exp_output_0"
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_24_1/calc_out_scale/Exp_output_0"
    name: "node_/Conv_24_1/calc_out_scale/Exp_output_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        name: "/Conv_24_1/calc_out_scale/Exp_output_0"
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_24_2/calc_out_scale/Exp_output_0"
    name: "node_/Conv_24_2/calc_out_scale/Exp_output_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        name: "/Conv_24_2/calc_out_scale/Exp_output_0"
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_24_3/calc_out_scale/Exp_output_0"
    name: "node_/Conv_24_3/calc_out_scale/Exp_output_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        name: "/Conv_24_3/calc_out_scale/Exp_output_0"
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_24_4/calc_out_scale/Exp_output_0"
    name: "node_/Conv_24_4/calc_out_scale/Exp_output_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        name: "/Conv_24_4/calc_out_scale/Exp_output_0"
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_24_5/calc_out_scale/Exp_output_0"
    name: "node_/Conv_24_5/calc_out_scale/Exp_output_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        name: "/Conv_24_5/calc_out_scale/Exp_output_0"
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_24_6/calc_out_scale/Exp_output_0"
    name: "node_/Conv_24_6/calc_out_scale/Exp_output_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        name: "/Conv_24_6/calc_out_scale/Exp_output_0"
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_12_1/calc_out_scale/Exp_output_0"
    name: "node_/Conv_12_1/calc_out_scale/Exp_output_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        name: "/Conv_12_1/calc_out_scale/Exp_output_0"
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/Conv_12_2/calc_out_scale/Exp_output_0"
